1	the	44960
2	and	30378
3		24933
4	a	24866
5	i	22691
6	to	21023
7	of	14406
8	was	13688
9	is	12054
10	it	11309
11	for	10573
12	in	10141
13	that	8200
14	with	7525
15	my	7362
16	but	7276
17	you	7102
18	this	6447
19	they	6367
20	on	6315
21	have	5962
22	we	5579
23	not	5184
24	are	4998
25	had	4956
26	at	4474
27	place	4466
28	so	4391
29	good	4381
30	were	4193
31	food	4021
32	be	3886
33	as	3832
34	there	3471
35	like	3411
36	great	3270
37	its	3119
38	all	3108
39	me	3090
40	if	3084
41	just	3078
42	very	3010
43	out	2971
44	here	2822
45	or	2717
46	one	2680
47	get	2662
48	their	2641
49	from	2553
50	up	2388
51	really	2331
52	go	2325
53	our	2325
54	when	2309
55	about	2290
56	time	2252
57	some	2223
58	would	2102
59	an	2059
60	your	2023
61	can	2002
62	service	1997
63	which	1988
64	been	1985
65	what	1969
66	back	1798
67	more	1795
68	dont	1778
69	only	1743
70	will	1719
71	also	1719
72	by	1680
73	no	1635
74	has	1542
75	little	1532
76	love	1472
77	other	1468
78	nice	1467
79	because	1451
80	too	1447
81	im	1398
82	always	1388
83	than	1378
84	well	1357
85	them	1352
86	do	1335
87	even	1328
88	us	1311
89	got	1262
90	pretty	1261
91	he	1250
92	best	1234
93	ive	1234
94	she	1218
95	after	1195
96	much	1193
97	chicken	1190
98	try	1148
99	ordered	1143
100	restaurant	1130
101	menu	1103
102	people	1094
103	think	1086
104	know	1085
105	didnt	1078
106	could	1077
107	am	1073
108	order	1061
109	make	1054
110	first	1045
111	over	1037
112	never	1035
113	staff	1014
114	bar	1008
115	did	1006
116	then	999
117	friendly	994
118	who	982
119	going	981
120	better	977
121	way	976
122	off	974
123	went	966
124	night	961
125	how	957
126	few	938
127	right	931
128	cheese	918
129	say	901
130	two	897
131	made	893
132	want	889
133	came	886
134	pizza	883
135	come	874
136	any	863
137	salad	857
138	delicious	853
139	new	842
140	still	827
141	now	823
142	sauce	822
143	lunch	821
144	take	813
145	fresh	805
146	before	792
147	see	786
148	cant	771
149	since	768
150	while	767
151	eat	761
152	definitely	756
153	find	755
154	her	751
155	sure	747
156	something	746
157	around	746
158	down	739
159	most	738
160	happy	734
161	many	734
162	experience	730
163	wait	726
164	every	725
165	day	724
166	bit	723
167	times	717
168	ever	710
169	2	708
170	everything	708
171	give	707
172	again	697
173	said	695
174	into	692
175	table	690
176	next	689
177	amazing	676
178	lot	673
179	bad	671
180	dinner	671
181	thing	671
182	though	665
183	location	656
184	where	653
185	both	652
186	being	649
187	small	647
188	area	645
189	meal	638
190	last	637
191	hour	631
192	side	625
193	youre	614
194	another	611
195	favorite	608
196	prices	604
197	3	602
198	wasnt	601
199	5	596
200	phoenix	596
201	big	593
202	hot	582
203	sandwich	577
204	drink	570
205	his	569
206	beer	567
207	things	564
208	thats	559
209	home	556
210	store	556
211	sweet	554
212	feel	552
213	minutes	549
214	drinks	549
215	burger	549
216	tasty	546
217	wine	545
218	worth	541
219	looking	540
220	should	540
221	enough	533
222	took	531
223	long	528
224	bread	527
225	different	524
226	fries	522
227	need	520
228	work	517
229	stars	514
230	friends	513
231	atmosphere	509
232	tried	504
233	room	504
234	taste	504
235	huge	498
236	years	496
237	old	494
238	actually	491
239	asked	486
240	recommend	483
241	awesome	481
242	those	479
243	price	479
244	selection	477
245	clean	476
246	breakfast	472
247	these	471
248	4	468
249	coffee	466
250	places	463
251	found	462
252	id	461
253	meat	459
254	quite	458
255	once	456
256	excellent	455
257	wanted	453
258	each	451
259	probably	451
260	friend	450
261	thought	450
262	nothing	450
263	kind	449
264	anything	449
265	special	449
266	server	447
267	same	446
268	usually	443
269	quality	442
270	visit	440
271	look	439
272	rice	439
273	super	438
274	flavor	435
275	free	428
276	scottsdale	428
277	full	426
278	large	426
279	check	422
280	perfect	419
281	why	419
282	cream	419
283	sushi	416
284	dish	414
285	maybe	411
286	house	408
287	told	405
288	without	405
289	beef	405
290	used	404
291	top	404
292	ok	402
293	cool	399
294	outside	398
295	however	398
296	ill	398
297	far	394
298	away	393
299	items	392
300	fried	389
301	review	387
302	town	384
303	served	384
304	getting	380
305	decided	379
306	ask	376
307	least	376
308	left	375
309	10	373
310	inside	372
311	having	372
312	fun	372
313	three	371
314	open	369
315	pork	369
316	loved	368
317	parking	366
318	may	366
319	enjoy	359
320	through	356
321	half	355
322	patio	354
323	everyone	353
324	else	353
325	red	352
326	spicy	352
327	put	352
328	enjoyed	352
329	spot	352
330	soup	350
331	makes	350
332	couple	349
333	family	347
334	decent	346
335	hard	345
336	busy	344
337	dishes	344
338	whole	339
339	ice	337
340	music	336
341	high	336
342	almost	336
343	restaurants	334
344	plate	334
345	water	333
346	course	332
347	close	332
348	eating	332
349	isnt	329
350	wont	328
351	such	327
352	chips	327
353	part	323
354	mexican	323
355	kids	323
356	live	321
357	does	321
358	husband	319
359	doesnt	317
360	wonderful	313
361	several	312
362	green	312
363	chocolate	311
364	during	311
365	dining	311
366	local	310
367	care	310
368	tables	309
369	looked	308
370	oh	308
371	fan	308
372	tasted	306
373	liked	306
374	star	306
375	fantastic	304
376	especially	303
377	fish	302
378	reviews	302
379	fast	301
380	shop	300
381	own	299
382	hours	299
383	shrimp	299
384	tacos	298
385	waitress	298
386	let	298
387	him	296
388	might	295
389	use	295
390	someone	295
391	steak	293
392	customer	292
393	less	292
394	guy	290
395	coming	290
396	must	289
397	stuff	288
398	week	284
399	sit	284
400	door	284
401	1	283
402	either	282
403	business	282
404	yet	281
405	name	281
406	real	281
407	although	280
408	bring	280
409	tell	279
410	stop	279
411	started	278
412	quick	278
413	trying	275
414	overall	274
415	fact	274
416	done	274
417	yes	273
418	finally	272
419	end	272
420	myself	271
421	seems	270
422	thai	270
423	front	270
424	keep	269
425	line	269
426	gave	268
427	salsa	268
428	style	268
429	valley	268
430	comes	268
431	seemed	267
432	waiting	265
433	cheap	265
434	call	263
435	cooked	263
436	couldnt	262
437	decor	261
438	until	260
439	felt	260
440	street	260
441	walked	258
442	theyre	257
443	pay	254
444	lots	253
445	year	252
446	able	252
447	extra	252
448	called	252
449	walk	252
450	dessert	252
451	tea	251
452	20	250
453	drive	250
454	brought	249
455	money	249
456	bacon	247
457	kitchen	245
458	often	245
459	waiter	245
460	sat	244
461	deal	243
462	group	241
463	theres	240
464	today	239
465	guess	239
466	glass	239
467	wish	238
468	instead	237
469	yummy	237
470	disappointed	236
471	regular	236
472	wife	236
473	white	236
474	wouldnt	235
475	bbq	234
476	wrong	234
477	seem	233
478	second	233
479	needed	232
480	light	231
481	saw	231
482	offer	230
483	helpful	230
484	reason	230
485	beans	229
486	options	229
487	plus	228
488	highly	228
489	person	228
490	yelp	224
491	morning	224
492	buy	223
493	gets	223
494	absolutely	223
495	flavors	223
496	owner	223
497	start	222
498	help	222
499	expect	221
500	saturday	220
501	serve	220
502	stay	219
503	fine	219
504	mind	217
505	ago	216
506	potato	216
507	warm	216
508	size	215
509	dog	215
510	point	215
511	looks	214
512	seen	214
513	impressed	213
514	job	213
515	hotel	213
516	appetizer	212
517	making	212
518	seating	211
519	ate	211
520	pool	211
521	arrived	210
522	bowl	209
523	youll	209
524	roll	208
525	four	208
526	choice	208
527	easy	207
528	arizona	207
529	between	206
530	okay	205
531	pick	204
532	grilled	203
533	car	203
534	rolls	203
535	later	202
536	potatoes	201
537	wings	201
538	return	201
539	havent	200
540	chinese	200
541	party	200
542	perfectly	200
543	burrito	200
544	add	199
545	portions	198
546	type	197
547	etc	197
548	past	197
549	ended	196
550	early	195
551	sandwiches	195
552	ingredients	194
553	days	194
554	tempe	194
555	list	194
556	choose	194
557	dry	194
558	late	193
559	beautiful	193
560	mall	193
561	seated	192
562	extremely	192
563	cold	192
564	remember	192
565	quickly	192
566	leave	192
567	cute	191
568	sitting	191
569	packed	191
570	game	191
571	amount	191
572	burgers	191
573	plenty	190
574	variety	190
575	15	190
576	twice	189
577	attentive	189
578	6	189
579	french	188
580	across	188
581	friday	187
582	cake	187
583	anyone	187
584	counter	185
585	trip	184
586	reasonable	184
587	priced	183
588	butter	183
589	run	183
590	hit	183
591	guys	183
592	customers	182
593	date	181
594	believe	180
595	manager	180
596	cut	179
597	problem	179
598	12	178
599	waited	178
600	under	178
601	rather	178
602	average	178
603	working	178
604	egg	178
605	park	178
606	near	176
607	heard	176
608	along	176
609	sunday	175
610	show	174
611	eaten	174
612	shopping	173
613	sometimes	172
614	short	172
615	employees	172
616	main	172
617	seriously	172
618	unique	171
619	mean	171
620	watch	170
621	bite	170
622	comfortable	169
623	garlic	169
624	weekend	168
625	bill	168
626	eggs	168
627	slow	168
628	downtown	167
629	others	167
630	az	166
631	beers	166
632	surprised	166
633	crust	165
634	five	165
635	set	164
636	ones	164
637	pasta	163
638	behind	163
639	corn	163
640	ready	163
641	already	163
642	onion	162
643	knew	161
644	italian	160
645	neighborhood	159
646	taking	159
647	glad	159
648	tip	158
649	entire	158
650	simple	158
651	girl	157
652	tomato	157
653	crowd	157
654	salads	157
655	given	157
656	doing	156
657	totally	156
658	space	155
659	loud	155
660	servers	155
661	head	155
662	offered	154
663	expensive	154
664	read	153
665	available	153
666	school	153
667	walking	153
668	authentic	153
669	crispy	153
670	chef	153
671	specials	153
672	hope	152
673	ambiance	152
674	mom	151
675	ordering	151
676	evening	151
677	man	150
678	flavorful	150
679	life	150
680	arent	150
681	sausage	149
682	portion	149
683	taco	148
684	moved	148
685	expected	148
686	completely	148
687	kept	148
688	hand	147
689	market	147
690	black	147
691	sort	147
692	itself	147
693	30	147
694	feeling	147
695	gone	147
696	spend	146
697	cost	146
698	plates	146
699	yourself	145
700	hair	145
701	card	144
702	months	143
703	rest	143
704	appetizers	143
705	cup	143
706	choices	143
707	stopped	143
708	werent	142
709	idea	142
710	soon	141
711	foods	141
712	entrees	141
713	opened	141
714	world	140
715	8	139
716	dark	139
717	toppings	139
718	interesting	138
719	including	138
720	change	138
721	typical	138
722	birthday	137
723	located	137
724	grab	137
725	center	137
726	please	137
727	pho	137
728	bottle	136
729	onions	136
730	chain	135
731	curry	135
732	exactly	135
733	tastes	135
734	play	135
735	bland	135
736	asian	134
737	miss	134
738	excited	134
739	bucks	134
740	pieces	134
741	hungry	134
742	toast	134
743	saying	133
744	together	133
745	meals	133
746	cafe	133
747	kinda	132
748	recently	132
749	lettuce	132
750	empty	132
751	mac	131
752	needs	131
753	joint	130
754	unfortunately	130
755	crowded	130
756	homemade	130
757	hands	130
758	grill	129
759	charge	129
760	summer	128
761	veggies	127
762	tiny	127
763	office	127
764	spring	127
765	bartender	127
766	understand	127
767	unless	127
768	outdoor	127
769	pricey	127
770	club	126
771	mixed	126
772	stand	126
773	giving	126
774	w	126
775	owners	125
776	salmon	125
777	noticed	125
778	truly	125
779	wall	124
780	noodles	124
781	crab	124
782	7	124
783	cannot	124
784	tender	124
785	hate	123
786	strip	123
787	dressing	123
788	thanks	123
789	longer	123
790	blue	122
791	number	122
792	talk	121
793	shared	121
794	event	121
795	within	121
796	frozen	121
797	casual	121
798	pleasant	121
799	movie	121
800	veggie	120
801	forward	120
802	thank	120
803	chance	120
804	dip	120
805	single	120
806	anywhere	120
807	greasy	119
808	true	119
809	yeah	119
810	spinach	119
811	sides	119
812	phone	119
813	anyway	119
814	soft	119
815	oil	118
816	stores	118
817	company	118
818	afternoon	118
819	above	118
820	piece	118
821	note	118
822	goes	117
823	desert	117
824	prepared	117
825	mouth	117
826	low	117
827	dirty	117
828	filled	116
829	case	115
830	pie	115
831	slightly	115
832	craving	115
833	la	115
834	ribs	115
835	orders	114
836	share	114
837	watching	114
838	closed	114
839	weeks	114
840	takes	114
841	dogs	113
842	girls	113
843	sports	113
844	entree	113
845	thin	113
846	lady	113
847	serving	113
848	bought	112
849	talking	112
850	literally	112
851	100	112
852	fabulous	112
853	finish	112
854	youve	112
855	mix	112
856	lovely	112
857	tuna	111
858	spent	111
859	playing	111
860	tomatoes	110
861	fruit	110
862	except	110
863	pita	110
864	box	110
865	based	110
866	healthy	110
867	fairly	109
868	thinking	109
869	upon	109
870	whatever	109
871	added	109
872	city	109
873	face	108
874	tons	108
875	tasting	108
876	sorry	108
877	says	108
878	bag	108
879	floor	108
880	worst	108
881	total	107
882	due	107
883	hang	107
884	split	107
885	somewhere	107
886	easily	107
887	pizzas	107
888	corner	107
889	stuffed	107
890	roasted	106
891	vegetarian	106
892	item	106
893	finished	106
894	immediately	105
895	hear	105
896	boyfriend	105
897	prefer	105
898	airport	105
899	pulled	105
900	value	105
901	received	105
902	forget	105
903	taken	104
904	mine	104
905	sauces	104
906	lets	104
907	sign	104
908	picked	103
909	seats	103
910	fair	103
911	buffet	103
912	paying	103
913	alone	103
914	perhaps	103
915	art	102
916	horrible	102
917	vibe	102
918	building	102
919	middle	102
920	view	102
921	terrible	102
922	chili	102
923	section	102
924	book	102
925	lived	101
926	month	101
927	paid	101
928	filling	101
929	means	101
930	attention	101
931	cash	101
932	works	101
933	games	101
934	simply	101
935	turkey	101
936	orange	101
937	weird	101
938	seat	101
939	baked	101
940	word	100
941	9	100
942	personal	100
943	certainly	100
944	recommended	100
945	mostly	99
946	mention	99
947	traditional	99
948	daughter	99
949	wow	99
950	salty	99
951	yum	99
952	north	98
953	heat	98
954	stayed	98
955	brunch	98
956	weve	98
957	hummus	97
958	damn	97
959	beat	97
960	iced	97
961	east	97
962	seafood	97
963	crazy	97
964	soda	97
965	greeted	97
966	carne	96
967	tortilla	96
968	mood	96
969	slice	95
970	dr	95
971	yogurt	95
972	sound	95
973	minute	95
974	visiting	95
975	suggest	95
976	sad	95
977	combo	95
978	matter	94
979	treat	94
980	reasonably	94
981	nearly	94
982	lack	94
983	crisp	94
984	reading	94
985	seeing	94
986	option	93
987	50	93
988	bars	93
989	lamb	93
990	asking	93
991	thick	92
992	plan	92
993	bunch	92
994	central	92
995	cook	92
996	die	92
997	opinion	91
998	worked	91
999	baby	91
1000	guacamole	91
1001	salt	91
1002	basically	91
1003	mushrooms	91
1004	american	91
1005	using	91
1006	medium	90
1007	nights	90
1008	slices	90
1009	smell	90
1010	sour	90
1011	combination	90
1012	creamy	90
1013	bean	90
1014	cookies	90
1015	turned	90
1016	level	90
1017	honestly	90
1018	young	90
1019	grocery	89
1020	shot	89
1021	normally	89
1022	professional	89
1023	solid	89
1024	rooms	89
1025	hell	89
1026	difficult	89
1027	visited	88
1028	running	88
1029	glasses	88
1030	folks	88
1031	supposed	88
1032	coupon	88
1033	mediocre	88
1034	issue	88
1035	helped	87
1036	apparently	87
1037	rich	87
1038	peanut	87
1039	appreciate	87
1040	drinking	87
1041	peppers	87
1042	overpriced	87
1043	lost	86
1044	addition	86
1045	poor	86
1046	modern	86
1047	theater	86
1048	bruschetta	85
1049	rude	85
1050	cookie	85
1051	standard	85
1052	eye	85
1053	per	85
1054	kid	85
1055	lemon	85
1056	topped	85
1057	fix	85
1058	paper	84
1059	products	84
1060	stick	84
1061	complaint	84
1062	original	84
1063	opening	84
1064	brown	84
1065	chairs	84
1066	vegan	84
1067	happened	84
1068	margarita	84
1069	locations	84
1070	vietnamese	83
1071	ahead	83
1072	heavy	83
1073	whats	83
1074	usual	83
1075	pass	83
1076	touch	83
1077	honey	83
1078	rock	83
1079	gym	83
1080	classes	83
1081	spa	83
1082	flat	83
1083	seasoned	83
1084	write	83
1085	training	82
1086	pm	82
1087	limited	82
1088	chose	82
1089	particular	82
1090	margaritas	82
1091	ton	82
1092	hostess	82
1093	donuts	82
1094	olive	81
1095	tvs	81
1096	offers	81
1097	chandler	81
1098	knows	81
1099	desserts	81
1100	pepper	81
1101	carry	81
1102	n	81
1103	class	81
1104	mill	80
1105	living	80
1106	asada	80
1107	meats	80
1108	ranch	80
1109	shoes	80
1110	strange	80
1111	fat	80
1112	favorites	80
1113	loves	80
1114	otherwise	79
1115	considering	79
1116	tv	79
1117	admit	79
1118	expecting	79
1119	dollar	79
1120	generous	79
1121	generally	79
1122	quiet	79
1123	fancy	79
1124	milk	79
1125	theyve	78
1126	normal	78
1127	surprise	78
1128	checking	78
1129	lobster	78
1130	turn	78
1131	strong	78
1132	forgot	78
1133	pleased	78
1134	indian	78
1135	sell	78
1136	basil	78
1137	sugar	78
1138	sale	78
1139	gotten	78
1140	kick	78
1141	pancakes	78
1142	vanilla	77
1143	showed	77
1144	plain	77
1145	complete	77
1146	greek	77
1147	somewhat	77
1148	bathroom	77
1149	mess	77
1150	previous	76
1151	25	76
1152	vegetables	76
1153	included	76
1154	coconut	76
1155	waffles	76
1156	rating	76
1157	bartenders	76
1158	establishment	76
1159	patrons	76
1160	met	76
1161	cupcake	76
1162	driving	75
1163	bun	75
1164	move	75
1165	resort	75
1166	save	75
1167	juicy	75
1168	youd	75
1169	avocado	75
1170	starbucks	75
1171	cheaper	74
1172	smaller	74
1173	leaving	74
1174	meet	74
1175	machine	74
1176	questions	74
1177	straight	74
1178	weather	74
1179	moist	74
1180	west	74
1181	tap	74
1182	obviously	73
1183	known	73
1184	buffalo	73
1185	classic	73
1186	interior	73
1187	consider	73
1188	bottom	73
1189	purchase	73
1190	awful	73
1191	son	73
1192	deals	72
1193	barely	72
1194	become	72
1195	south	72
1196	odd	72
1197	lucky	72
1198	conversation	72
1199	40	72
1200	japanese	71
1201	covered	71
1202	deep	71
1203	changed	71
1204	fit	71
1205	consistently	71
1206	daily	71
1207	product	71
1208	walls	71
1209	apple	71
1210	sense	71
1211	website	70
1212	similar	70
1213	frequent	70
1214	incredibly	70
1215	none	70
1216	college	70
1217	nicely	70
1218	mini	70
1219	massage	70
1220	hey	70
1221	cozy	70
1222	cupcakes	70
1223	air	70
1224	mentioned	70
1225	checked	70
1226	owned	70
1227	children	70
1228	fill	70
1229	guests	70
1230	online	69
1231	closer	69
1232	missing	69
1233	chipotle	69
1234	weekends	69
1235	sun	69
1236	types	69
1237	likely	69
1238	tortillas	69
1239	welcome	69
1240	agree	69
1241	outstanding	69
1242	groupon	69
1243	rare	69
1244	lounge	69
1245	monday	68
1246	various	68
1247	support	68
1248	clothes	68
1249	particularly	68
1250	drop	68
1251	personally	68
1252	bed	68
1253	gelato	68
1254	45	68
1255	break	68
1256	avoid	68
1257	concept	68
1258	moment	68
1259	setting	68
1260	delivery	67
1261	returned	67
1262	goodness	67
1263	recent	67
1264	clear	67
1265	chicago	67
1266	boy	67
1267	wide	67
1268	sample	67
1269	nearby	67
1270	ten	67
1271	girlfriend	67
1272	clearly	67
1273	despite	67
1274	gross	67
1275	duck	67
1276	mashed	66
1277	realize	66
1278	mozzarella	66
1279	gravy	66
1280	compared	66
1281	knowledgeable	66
1282	soggy	66
1283	shredded	66
1284	bell	66
1285	positive	66
1286	hubby	66
1287	venue	66
1288	desk	66
1289	greens	66
1290	menus	65
1291	whether	65
1292	hole	65
1293	color	65
1294	mushroom	65
1295	de	65
1296	spice	65
1297	pleasantly	65
1298	wines	65
1299	imagine	65
1300	road	65
1301	notice	65
1302	themselves	65
1303	important	65
1304	par	65
1305	incredible	65
1306	san	65
1307	noodle	65
1308	speak	65
1309	woman	64
1310	worse	64
1311	credit	64
1312	country	64
1313	rings	64
1314	crunchy	64
1315	kinds	64
1316	honest	64
1317	sliders	64
1318	cooking	64
1319	eyes	64
1320	convenient	64
1321	tonight	63
1322	joes	63
1323	forever	63
1324	gem	63
1325	funny	63
1326	rate	63
1327	throughout	63
1328	sized	63
1329	selections	63
1330	heaven	63
1331	miles	63
1332	system	63
1333	bakery	63
1334	min	63
1335	refreshing	63
1336	chile	63
1337	presentation	63
1338	waffle	63
1339	ass	63
1340	crap	63
1341	dollars	63
1342	double	63
1343	cover	63
1344	hes	63
1345	delish	62
1346	lighting	62
1347	cuisine	62
1348	books	62
1349	popular	62
1350	parents	62
1351	areas	62
1352	pad	62
1353	sick	62
1354	basic	62
1355	actual	62
1356	heart	62
1357	chill	62
1358	hip	62
1359	wrap	62
1360	smoked	62
1361	bottles	61
1362	hold	61
1363	organic	61
1364	station	61
1365	shops	61
1366	chopped	61
1367	trendy	61
1368	enchiladas	61
1369	bigger	61
1370	chorizo	61
1371	smile	61
1372	cocktails	61
1373	hoping	61
1374	feels	60
1375	mayo	60
1376	range	60
1377	window	60
1378	chefs	60
1379	overly	60
1380	general	60
1381	god	60
1382	typically	60
1383	finding	60
1384	cucumber	60
1385	sub	60
1386	relaxing	60
1387	nails	60
1388	olives	59
1389	larger	59
1390	mesa	59
1391	pot	59
1392	gift	59
1393	management	59
1394	occasion	59
1395	wanting	59
1396	figured	59
1397	environment	59
1398	possible	59
1399	sales	59
1400	happen	59
1401	anymore	59
1402	laid	59
1403	bathrooms	59
1404	dad	58
1405	banana	58
1406	bringing	58
1407	continue	58
1408	efficient	58
1409	shit	58
1410	flight	58
1411	six	58
1412	brisket	58
1413	willing	58
1414	st	58
1415	negative	58
1416	expectations	58
1417	wash	58
1418	broth	58
1419	band	58
1420	certain	58
1421	bonus	58
1422	reservation	57
1423	appointment	57
1424	delivered	57
1425	higher	57
1426	tuesday	57
1427	burritos	57
1428	staying	57
1429	standing	57
1430	gyro	57
1431	cocktail	57
1432	takeout	57
1433	fare	57
1434	calamari	57
1435	biggest	57
1436	gives	57
1437	fire	56
1438	attitude	56
1439	wifi	56
1440	round	56
1441	creme	56
1442	passed	56
1443	24	56
1444	tough	56
1445	boba	56
1446	spots	56
1447	brand	56
1448	issues	56
1449	hanging	56
1450	yesterday	56
1451	sucks	56
1452	dance	56
1453	welcoming	56
1454	specialty	56
1455	complain	56
1456	garden	55
1457	pudding	55
1458	wonder	55
1459	tofu	55
1460	rib	55
1461	pop	55
1462	disappointment	55
1463	plastic	55
1464	sent	55
1465	california	55
1466	figure	55
1467	coworkers	55
1468	awhile	55
1469	notch	55
1470	experienced	55
1471	bf	55
1472	lights	55
1473	valet	54
1474	texture	54
1475	booths	54
1476	produce	54
1477	english	54
1478	chip	54
1479	juice	54
1480	dead	54
1481	dozen	54
1482	shows	54
1483	strawberry	54
1484	words	54
1485	pesto	54
1486	overcooked	54
1487	decide	54
1488	private	54
1489	mistake	54
1490	upscale	54
1491	explained	53
1492	dim	53
1493	mile	53
1494	serious	53
1495	dive	53
1496	ground	53
1497	multiple	53
1498	sister	53
1499	ridiculous	53
1500	ride	53
1501	throw	53
1502	giant	53
1503	asu	53
1504	complimentary	53
1505	annoying	53
1506	nachos	53
1507	serves	53
1508	suggested	53
1509	lines	53
1510	camelback	53
1511	meeting	53
1512	scene	53
1513	freshly	53
1514	soy	53
1515	arrive	53
1516	espresso	52
1517	hadnt	52
1518	sake	52
1519	beyond	52
1520	leftovers	52
1521	extensive	52
1522	paradise	52
1523	raw	52
1524	gas	52
1525	sliced	52
1526	bagel	52
1527	consistent	52
1528	version	52
1529	alcohol	52
1530	surprisingly	52
1531	placed	52
1532	rail	52
1533	wearing	52
1534	polite	52
1535	satisfied	52
1536	complaints	52
1537	doors	51
1538	onto	51
1539	include	51
1540	trust	51
1541	melted	51
1542	artichoke	51
1543	velvet	51
1544	fashion	51
1545	aside	51
1546	inexpensive	51
1547	experiences	51
1548	catch	51
1549	35	51
1550	mango	51
1551	purchased	51
1552	heres	51
1553	dress	51
1554	darn	51
1555	cause	51
1556	remembered	51
1557	pricing	51
1558	beverage	51
1559	sold	50
1560	future	50
1561	difference	50
1562	pair	50
1563	comfy	50
1564	lacking	50
1565	mint	50
1566	rush	50
1567	ham	50
1568	spectacular	50
1569	wrapped	50
1570	department	50
1571	earlier	50
1572	reminded	50
1573	key	50
1574	reminds	50
1575	impressive	50
1576	scallops	50
1577	charged	50
1578	ladies	50
1579	whenever	50
1580	tired	50
1581	salon	50
1582	wed	50
1583	pineapple	49
1584	fall	49
1585	york	49
1586	fry	49
1587	platter	49
1588	leaves	49
1589	lol	49
1590	explain	49
1591	cleaning	49
1592	employee	49
1593	describe	49
1594	ny	49
1595	wants	49
1596	stuck	49
1597	health	49
1598	goat	49
1599	update	49
1600	moving	49
1601	deli	49
1602	travel	49
1603	disappointing	49
1604	tour	49
1605	hopefully	48
1606	creative	48
1607	provided	48
1608	martini	48
1609	cakes	48
1610	everywhere	48
1611	movies	48
1612	spices	48
1613	opted	48
1614	mother	48
1615	perfection	48
1616	answer	48
1617	compare	48
1618	coke	48
1619	step	48
1620	body	48
1621	mustard	48
1622	sounds	48
1623	caramel	48
1624	candy	48
1625	wedding	47
1626	distance	47
1627	pictures	47
1628	mountain	47
1629	luckily	47
1630	wednesday	47
1631	enjoying	47
1632	major	47
1633	clothing	47
1634	screen	47
1635	sprouts	47
1636	gourmet	47
1637	state	47
1638	ave	47
1639	windows	47
1640	lemonade	47
1641	fell	47
1642	older	47
1643	yellow	47
1644	13	47
1645	accommodating	47
1646	hash	47
1647	won	47
1648	send	46
1649	elsewhere	46
1650	affordable	46
1651	buying	46
1652	bianco	46
1653	omelet	46
1654	toasted	46
1655	stomach	46
1656	decision	46
1657	feet	46
1658	alright	46
1659	discount	46
1660	prompt	46
1661	includes	46
1662	yelpers	46
1663	appreciated	46
1664	famous	46
1665	played	46
1666	sum	46
1667	11	46
1668	design	46
1669	prior	45
1670	uncomfortable	45
1671	reservations	45
1672	likes	45
1673	superb	45
1674	irish	45
1675	luck	45
1676	cheesecake	45
1677	eggplant	45
1678	changes	45
1679	realized	45
1680	men	45
1681	third	45
1682	waste	45
1683	los	45
1684	gluten	45
1685	dipping	45
1686	cheesy	45
1687	filet	45
1688	b	45
1689	quaint	45
1690	blah	45
1691	recommendation	45
1692	picky	45
1693	post	45
1694	thursday	45
1695	process	45
1696	fully	45
1697	treated	44
1698	slaw	44
1699	ya	44
1700	hidden	44
1701	hello	44
1702	equally	44
1703	story	44
1704	apart	44
1705	safe	44
1706	pull	44
1707	team	44
1708	question	44
1709	register	44
1710	provide	44
1711	against	44
1712	bites	44
1713	gorgeous	44
1714	express	44
1715	oven	44
1716	keeps	44
1717	unlike	44
1718	random	44
1719	sangria	44
1720	gonna	44
1721	discovered	43
1722	omg	43
1723	bags	43
1724	package	43
1725	ran	43
1726	vegetable	43
1727	points	43
1728	relax	43
1729	prime	43
1730	knowing	43
1731	ball	43
1732	cars	43
1733	skip	43
1734	golden	43
1735	starting	43
1736	example	43
1737	disgusting	43
1738	furniture	43
1739	breast	43
1740	booth	43
1741	drove	43
1742	spending	43
1743	texas	43
1744	cashier	43
1745	helping	43
1746	theyll	43
1747	farm	42
1748	tend	42
1749	excuse	42
1750	ahi	42
1751	absolute	42
1752	learn	42
1753	separate	42
1754	heck	42
1755	cents	42
1756	flavored	42
1757	patient	42
1758	golf	42
1759	entrance	42
1760	soooo	42
1761	apologized	42
1762	hike	42
1763	neat	42
1764	headed	42
1765	lime	42
1766	picture	42
1767	possibly	42
1768	host	42
1769	carrots	42
1770	tempura	42
1771	dj	42
1772	advice	42
1773	smoke	42
1774	facility	42
1775	shape	42
1776	miso	42
1777	subway	42
1778	burnt	42
1779	signature	41
1780	pub	41
1781	among	41
1782	gotta	41
1783	somehow	41
1784	vodka	41
1785	peak	41
1786	latte	41
1787	pink	41
1788	brownie	41
1789	cups	41
1790	agreed	41
1791	talked	41
1792	cheddar	41
1793	pickles	41
1794	wear	41
1795	putting	41
1796	returning	41
1797	courses	41
1798	layout	41
1799	crave	41
1800	romantic	41
1801	create	41
1802	60	41
1803	women	41
1804	peaks	41
1805	waitstaff	41
1806	deliver	41
1807	situation	41
1808	dropped	41
1809	frosting	41
1810	offerings	40
1811	shes	40
1812	groups	40
1813	chewy	40
1814	diet	40
1815	trail	40
1816	views	40
1817	app	40
1818	chains	40
1819	below	40
1820	correct	40
1821	exceptional	40
1822	tad	40
1823	sadly	40
1824	season	40
1825	rocks	40
1826	tickets	40
1827	pastry	40
1828	learned	40
1829	teriyaki	40
1830	missed	40
1831	goto	40
1832	hardly	40
1833	board	40
1834	sky	40
1835	secret	40
1836	soups	40
1837	needless	40
1838	nail	40
1839	charming	40
1840	roast	39
1841	enter	39
1842	bomb	39
1843	opportunity	39
1844	vs	39
1845	services	39
1846	alternative	39
1847	ambience	39
1848	snack	39
1849	nor	39
1850	cards	39
1851	stadium	39
1852	adding	39
1853	library	39
1854	parmesan	39
1855	besides	39
1856	dough	39
1857	bright	39
1858	child	39
1859	cilantro	39
1860	sizes	39
1861	contact	39
1862	noise	39
1863	further	39
1864	information	39
1865	intimate	39
1866	cherry	39
1867	football	39
1868	dine	39
1869	delightful	39
1870	tapas	39
1871	quesadilla	39
1872	basis	39
1873	mexico	38
1874	pasty	38
1875	natural	38
1876	visits	38
1877	lobby	38
1878	allowed	38
1879	sharing	38
1880	rarely	38
1881	wild	38
1882	businesses	38
1883	dressed	38
1884	grease	38
1885	writing	38
1886	enjoyable	38
1887	sea	38
1888	dig	38
1889	prepare	38
1890	comment	38
1891	doubt	38
1892	phenomenal	38
1893	belly	38
1894	goods	38
1895	shouldnt	38
1896	fault	38
1897	everyday	38
1898	skin	38
1899	shocked	38
1900	jam	38
1901	vintage	38
1902	cheeses	38
1903	mongolian	38
1904	pepperoni	38
1905	keeping	38
1906	bloody	38
1907	pei	38
1908	wei	38
1909	theyd	37
1910	community	37
1911	budget	37
1912	topping	37
1913	shake	37
1914	bother	37
1915	mild	37
1916	wood	37
1917	following	37
1918	advantage	37
1919	baseball	37
1920	informed	37
1921	waitresses	37
1922	self	37
1923	problems	37
1924	inviting	37
1925	sooo	37
1926	personality	37
1927	bistro	37
1928	ways	37
1929	shower	37
1930	syrup	37
1931	named	37
1932	prosciutto	37
1933	suggestions	37
1934	shell	37
1935	urban	37
1936	bowls	37
1937	andor	37
1938	potential	37
1939	china	37
1940	age	37
1941	promptly	37
1942	grass	37
1943	phx	37
1944	count	36
1945	happens	36
1946	telling	36
1947	turns	36
1948	diner	36
1949	ticket	36
1950	switch	36
1951	followed	36
1952	treats	36
1953	reviewers	36
1954	benedict	36
1955	hype	36
1956	workers	36
1957	relaxed	36
1958	broccoli	36
1959	stock	36
1960	popcorn	36
1961	pet	36
1962	internet	36
1963	diners	36
1964	heading	36
1965	caesar	36
1966	receive	36
1967	afraid	36
1968	attempt	36
1969	joints	36
1970	safeway	36
1971	terrific	36
1972	hint	36
1973	grand	36
1974	worry	36
1975	machines	36
1976	follow	36
1977	boys	36
1978	lower	36
1979	calories	36
1980	thru	36
1981	pedicure	36
1982	managed	35
1983	member	35
1984	introduced	35
1985	kidding	35
1986	thoroughly	35
1987	rolled	35
1988	current	35
1989	bike	35
1990	seared	35
1991	smooth	35
1992	score	35
1993	himself	35
1994	refill	35
1995	samples	35
1996	ourselves	35
1997	batter	35
1998	flavorless	35
1999	sounded	35
2000	mins	35
2001	planning	35
2002	sticky	35
2003	rushed	35
2004	final	35
2005	search	35
2006	additional	35
2007	sashimi	35
2008	stood	35
2009	wheat	35
2010	broke	35
2011	steaks	35
2012	degree	35
2013	pleasure	35
2014	effort	35
2015	jack	35
2016	jalapeno	35
2017	request	35
2018	jerk	35
2019	factor	35
2020	neither	35
2021	weekly	35
2022	fans	35
2023	comfort	35
2024	members	35
2025	boring	35
2026	watched	35
2027	ginger	35
2028	ac	35
2029	haircut	35
2030	gilbert	34
2031	winter	34
2032	biscuits	34
2033	crunch	34
2034	complex	34
2035	entered	34
2036	guest	34
2037	handle	34
2038	begin	34
2039	impossible	34
2040	became	34
2041	peach	34
2042	stupid	34
2043	husbands	34
2044	feed	34
2045	fave	34
2046	culinary	34
2047	steamed	34
2048	corporate	34
2049	vegas	34
2050	chair	34
2051	tips	34
2052	photo	34
2053	pretentious	34
2054	adorable	34
2055	fellow	34
2056	strips	34
2057	common	34
2058	appeared	34
2059	chunks	34
2060	browns	34
2061	theme	34
2062	alot	34
2063	loaded	34
2064	recommendations	34
2065	dined	34
2066	apps	34
2067	towards	34
2068	chris	34
2069	traffic	34
2070	foot	34
2071	truck	34
2072	public	34
2073	former	33
2074	lit	33
2075	christmas	33
2076	lazy	33
2077	decorated	33
2078	custard	33
2079	joke	33
2080	threw	33
2081	overwhelming	33
2082	drunk	33
2083	handed	33
2084	blown	33
2085	occasions	33
2086	shame	33
2087	events	33
2088	panini	33
2089	german	33
2090	ale	33
2091	till	33
2092	dates	33
2093	careful	33
2094	interested	33
2095	easier	33
2096	grew	33
2097	security	33
2098	classy	33
2099	anyways	33
2100	mr	33
2101	regulars	33
2102	cinnamon	33
2103	joe	33
2104	control	33
2105	caught	33
2106	yoga	33
2107	museum	33
2108	fingers	32
2109	fig	32
2110	granted	32
2111	deserve	32
2112	entertainment	32
2113	hospital	32
2114	win	32
2115	trips	32
2116	picking	32
2117	martinis	32
2118	signs	32
2119	reasons	32
2120	co	32
2121	fluffy	32
2122	locally	32
2123	native	32
2124	garage	32
2125	bus	32
2126	sampler	32
2127	ring	32
2128	broken	32
2129	watering	32
2130	colors	32
2131	bands	32
2132	concerned	32
2133	salted	32
2134	crew	32
2135	mahi	32
2136	spacious	32
2137	farmers	32
2138	tart	32
2139	equipment	32
2140	insurance	32
2141	showing	32
2142	eventually	32
2143	appropriate	32
2144	jalapenos	32
2145	adults	32
2146	appears	32
2147	cheeseburger	32
2148	indoor	32
2149	pizzeria	32
2150	eats	31
2151	stumbled	31
2152	favor	31
2153	draft	31
2154	hits	31
2155	pretzels	31
2156	coupons	31
2157	punch	31
2158	root	31
2159	saving	31
2160	generic	31
2161	refills	31
2162	chat	31
2163	originally	31
2164	studio	31
2165	square	31
2166	wraps	31
2167	fav	31
2168	scoop	31
2169	fake	31
2170	hearing	31
2171	wouldve	31
2172	ketchup	31
2173	balance	31
2174	exception	31
2175	lightly	31
2176	soso	31
2177	guac	31
2178	seasoning	31
2179	14	31
2180	fitness	31
2181	gyros	31
2182	tasteless	31
2183	nuts	31
2184	listen	31
2185	fiance	31
2186	cornbread	31
2187	doctor	31
2188	southwest	31
2189	biltmore	31
2190	toys	31
2191	lose	31
2192	stew	31
2193	chai	31
2194	confused	31
2195	regardless	30
2196	listed	30
2197	bc	30
2198	mens	30
2199	fez	30
2200	tamales	30
2201	tires	30
2202	oz	30
2203	closing	30
2204	jungle	30
2205	anytime	30
2206	metro	30
2207	melt	30
2208	blow	30
2209	seconds	30
2210	18	30
2211	cabbage	30
2212	boxes	30
2213	jeans	30
2214	ample	30
2215	challenge	30
2216	holding	30
2217	bagels	30
2218	truffle	30
2219	starving	30
2220	dried	30
2221	drinker	30
2222	numerous	30
2223	form	30
2224	balsamic	30
2225	nasty	30
2226	frys	30
2227	feta	30
2228	matts	30
2229	terms	30
2230	pollo	30
2231	began	30
2232	dancing	30
2233	cooler	30
2234	partner	30
2235	everybody	30
2236	amazingly	30
2237	students	30
2238	fee	30
2239	basket	30
2240	locals	30
2241	feature	30
2242	cares	30
2243	killer	30
2244	video	30
2245	queso	30
2246	regret	30
2247	hawaiian	30
2248	downside	30
2249	asparagus	30
2250	el	30
2251	ceviche	30
2252	impression	30
2253	manicure	30
2254	selling	29
2255	messy	29
2256	calling	29
2257	grown	29
2258	claim	29
2259	tire	29
2260	dream	29
2261	hurry	29
2262	d	29
2263	seasonal	29
2264	bet	29
2265	recall	29
2266	savory	29
2267	napkins	29
2268	entering	29
2269	saved	29
2270	allow	29
2271	starts	29
2272	wrote	29
2273	industry	29
2274	block	29
2275	island	29
2276	suggestion	29
2277	spoon	29
2278	cuz	29
2279	wet	29
2280	tucked	29
2281	specifically	29
2282	meh	29
2283	social	29
2284	disappoint	29
2285	edamame	29
2286	meatballs	29
2287	500	29
2288	parts	29
2289	judge	29
2290	fountain	29
2291	iti	29
2292	chop	29
2293	runs	29
2294	court	29
2295	avenue	29
2296	charm	29
2297	shoe	29
2298	gold	29
2299	dirt	29
2300	specific	29
2301	recipe	29
2302	assortment	29
2303	meant	29
2304	pure	28
2305	program	28
2306	practice	28
2307	replaced	28
2308	blocks	28
2309	crappy	28
2310	personable	28
2311	afford	28
2312	offering	28
2313	row	28
2314	mojito	28
2315	diverse	28
2316	smelled	28
2317	act	28
2318	stage	28
2319	jimmy	28
2320	detail	28
2321	suppose	28
2322	costco	28
2323	moon	28
2324	dentist	28
2325	fly	28
2326	sets	28
2327	hasnt	28
2328	spread	28
2329	held	28
2330	stands	28
2331	weak	28
2332	wondering	28
2333	waiters	28
2334	fridays	28
2335	rum	28
2336	goodthe	28
2337	brulee	28
2338	hearty	28
2339	adult	28
2340	fucking	28
2341	indeed	28
2342	lame	28
2343	hamburger	28
2344	test	28
2345	marinara	28
2346	2nd	28
2347	response	28
2348	ingredient	28
2349	thumbs	28
2350	weight	28
2351	16	28
2352	repair	28
2353	eater	28
2354	church	28
2355	hipster	28
2356	nope	28
2357	beverages	28
2358	raspberry	28
2359	spaghetti	28
2360	facial	28
2361	memorable	27
2362	sucked	27
2363	jewelry	27
2364	convinced	27
2365	90	27
2366	breads	27
2367	sucker	27
2368	beginning	27
2369	200	27
2370	opposed	27
2371	champagne	27
2372	closest	27
2373	refilled	27
2374	sticks	27
2375	craft	27
2376	grabbed	27
2377	history	27
2378	coast	27
2379	cooks	27
2380	snacks	27
2381	glendale	27
2382	king	27
2383	supporting	27
2384	buttery	27
2385	directly	27
2386	buddy	27
2387	blood	27
2388	chatting	27
2389	cajun	27
2390	arcadia	27
2391	liking	27
2392	lover	27
2393	practically	27
2394	pile	27
2395	anniversary	27
2396	preferred	27
2397	karaoke	27
2398	girlfriends	27
2399	created	27
2400	match	27
2401	booked	27
2402	hotels	27
2403	answered	27
2404	presented	27
2405	gallo	27
2406	togo	27
2407	desired	27
2408	ajs	27
2409	display	27
2410	macaroni	27
2411	moms	27
2412	celebrate	27
2413	spoke	27
2414	organized	27
2415	nyc	27
2416	animals	26
2417	balls	26
2418	beats	26
2419	stepped	26
2420	staple	26
2421	stated	26
2422	arugula	26
2423	genuine	26
2424	oysters	26
2425	names	26
2426	falafel	26
2427	sampled	26
2428	brick	26
2429	requested	26
2430	burn	26
2431	brie	26
2432	dos	26
2433	pumpkin	26
2434	pack	26
2435	accept	26
2436	ravioli	26
2437	properly	26
2438	noisy	26
2439	build	26
2440	sodas	26
2441	welcomed	26
2442	parties	26
2443	brings	26
2444	piping	26
2445	mussels	26
2446	salsas	26
2447	stale	26
2448	cleaned	26
2449	individual	26
2450	satisfying	26
2451	fajitas	26
2452	result	26
2453	smells	26
2454	workout	26
2455	edible	26
2456	brews	26
2457	hooked	26
2458	picnic	26
2459	promise	26
2460	ultimate	26
2461	custom	26
2462	stocked	26
2463	speaking	26
2464	harbor	26
2465	blend	26
2466	em	26
2467	sprinkles	26
2468	buds	26
2469	torta	26
2470	lacked	26
2471	reach	26
2472	sorts	26
2473	costs	26
2474	gf	26
2475	raised	26
2476	pint	26
2477	non	26
2478	ramen	26
2479	teacher	26
2480	donut	26
2481	holy	25
2482	unbelievable	25
2483	receipt	25
2484	rd	25
2485	yay	25
2486	pan	25
2487	occasionally	25
2488	importantly	25
2489	companion	25
2490	kill	25
2491	wtf	25
2492	ignored	25
2493	falling	25
2494	marketplace	25
2495	brewery	25
2496	freaking	25
2497	upstairs	25
2498	greatest	25
2499	cart	25
2500	trouble	25
2501	relatively	25
2502	wise	25
2503	constantly	25
2504	subs	25
2505	lolos	25
2506	ipa	25
2507	delight	25
2508	attending	25
2509	stopping	25
2510	theirs	25
2511	blame	25
2512	towels	25
2513	handful	25
2514	fork	25
2515	plaza	25
2516	access	25
2517	rave	25
2518	considered	25
2519	amounts	25
2520	vig	25
2521	cider	25
2522	raved	25
2523	energy	25
2524	pour	25
2525	enchilada	25
2526	fight	25
2527	knowledge	25
2528	brother	25
2529	spanish	25
2530	albeit	25
2531	plantains	25
2532	unusual	25
2533	dude	25
2534	j	25
2535	winner	25
2536	america	25
2537	hut	25
2538	heavenly	25
2539	liquor	25
2540	frequently	25
2541	gel	25
2542	l	24
2543	led	24
2544	happily	24
2545	inn	24
2546	pear	24
2547	accompanied	24
2548	sometime	24
2549	knowledgable	24
2550	active	24
2551	asks	24
2552	inch	24
2553	shuttle	24
2554	minus	24
2555	hence	24
2556	tells	24
2557	teas	24
2558	23	24
2559	papaya	24
2560	sexy	24
2561	bits	24
2562	stellar	24
2563	leather	24
2564	southwestern	24
2565	complaining	24
2566	field	24
2567	adventure	24
2568	99	24
2569	adore	24
2570	tab	24
2571	john	24
2572	campus	24
2573	national	24
2574	shots	24
2575	iron	24
2576	eager	24
2577	details	24
2578	grounds	24
2579	tall	24
2580	tequila	24
2581	bears	24
2582	lively	24
2583	foodie	24
2584	complained	24
2585	photos	24
2586	improved	24
2587	itthe	24
2588	terminal	24
2589	timely	24
2590	comparable	24
2591	background	24
2592	smoky	24
2593	economy	24
2594	present	24
2595	consistency	24
2596	latest	24
2597	schedule	24
2598	muffin	24
2599	period	24
2600	jazz	24
2601	features	24
2602	reviewed	24
2603	painted	24
2604	s	24
2605	account	24
2606	battered	24
2607	mainly	24
2608	screens	24
2609	flowers	24
2610	changing	24
2611	pico	24
2612	via	24
2613	forced	24
2614	patty	24
2615	brew	24
2616	mary	24
2617	tavern	24
2618	stir	24
2619	canned	23
2620	funky	23
2621	vacation	23
2622	clients	23
2623	vet	23
2624	dennys	23
2625	familiar	23
2626	forgotten	23
2627	pants	23
2628	initially	23
2629	checks	23
2630	speed	23
2631	pain	23
2632	depending	23
2633	definately	23
2634	ridiculously	23
2635	horchata	23
2636	address	23
2637	chilis	23
2638	fox	23
2639	lil	23
2640	postino	23
2641	pressure	23
2642	attended	23
2643	bottled	23
2644	microwave	23
2645	parked	23
2646	cousin	23
2647	mole	23
2648	grace	23
2649	passing	23
2650	highlight	23
2651	listening	23
2652	ceiling	23
2653	trader	23
2654	coworker	23
2655	site	23
2656	deciding	23
2657	gay	23
2658	appealing	23
2659	bargain	23
2660	swear	23
2661	hunt	23
2662	code	23
2663	downstairs	23
2664	ie	23
2665	midnight	23
2666	grits	23
2667	hopes	23
2668	slight	23
2669	shoot	23
2670	email	23
2671	mission	23
2672	cowboy	23
2673	frank	23
2674	caring	23
2675	250	23
2676	catering	23
2677	5th	23
2678	las	23
2679	hangover	23
2680	confusing	23
2681	34	23
2682	buns	23
2683	frankly	23
2684	aint	23
2685	hurt	23
2686	stone	23
2687	pickle	23
2688	dresses	23
2689	massive	23
2690	southern	23
2691	lake	23
2692	soap	23
2693	grind	23
2694	trash	23
2695	base	23
2696	q	23
2697	calls	23
2698	uses	23
2699	cross	23
2700	fondue	23
2701	spoiled	22
2702	womens	22
2703	conversations	22
2704	emergency	22
2705	walmart	22
2706	interest	22
2707	festival	22
2708	provides	22
2709	circle	22
2710	conference	22
2711	tops	22
2712	wing	22
2713	300	22
2714	eatery	22
2715	finger	22
2716	death	22
2717	shade	22
2718	instantly	22
2719	t	22
2720	smoothie	22
2721	lux	22
2722	cuts	22
2723	shirt	22
2724	bay	22
2725	chow	22
2726	load	22
2727	awkward	22
2728	hall	22
2729	assume	22
2730	ending	22
2731	property	22
2732	temperature	22
2733	laughing	22
2734	maple	22
2735	male	22
2736	theaters	22
2737	pretend	22
2738	subpar	22
2739	flatbread	22
2740	destination	22
2741	comparison	22
2742	calzone	22
2743	patron	22
2744	ra	22
2745	tail	22
2746	beds	22
2747	glazed	22
2748	worried	22
2749	bank	22
2750	poured	22
2751	heads	22
2752	weekday	22
2753	manner	22
2754	thinks	22
2755	retail	22
2756	worthy	22
2757	initial	22
2758	wasted	22
2759	hers	22
2760	pools	22
2761	planned	22
2762	volume	22
2763	scratch	22
2764	burned	22
2765	younger	22
2766	warning	22
2767	goodies	22
2768	pointed	22
2769	barbecue	22
2770	skillet	22
2771	francisco	22
2772	described	22
2773	seven	22
2774	teeth	22
2775	cole	22
2776	surgery	22
2777	suck	22
2778	3rd	22
2779	meatloaf	22
2780	minimal	22
2781	treatment	22
2782	zucchini	22
2783	yard	22
2784	ocean	22
2785	updated	22
2786	plentiful	22
2787	tag	22
2788	crowds	22
2789	caramelized	22
2790	def	22
2791	couches	22
2792	booze	22
2793	alas	22
2794	tax	22
2795	hop	22
2796	holes	22
2797	pastries	22
2798	gras	22
2799	families	22
2800	assured	22
2801	chic	22
2802	theatre	22
2803	barrio	22
2804	inspired	22
2805	pound	21
2806	horseradish	21
2807	carnitas	21
2808	continued	21
2809	animal	21
2810	pets	21
2811	focus	21
2812	sons	21
2813	accommodate	21
2814	student	21
2815	thankfully	21
2816	district	21
2817	tossed	21
2818	houstons	21
2819	cleanliness	21
2820	path	21
2821	occasional	21
2822	dairy	21
2823	power	21
2824	sundae	21
2825	premade	21
2826	thrilled	21
2827	marinated	21
2828	select	21
2829	hh	21
2830	cheapest	21
2831	ca	21
2832	popped	21
2833	upset	21
2834	rainbow	21
2835	impress	21
2836	varieties	21
2837	someones	21
2838	7th	21
2839	mocha	21
2840	collection	21
2841	bone	21
2842	mrs	21
2843	whites	21
2844	hoped	21
2845	btw	21
2846	divine	21
2847	fees	21
2848	mojo	21
2849	wallet	21
2850	al	21
2851	pretzel	21
2852	unlimited	21
2853	plans	21
2854	warned	21
2855	pissed	21
2856	beet	21
2857	breaded	21
2858	80s	21
2859	guilty	21
2860	aware	21
2861	lunches	21
2862	spiced	21
2863	written	21
2864	toward	21
2865	4th	21
2866	fits	21
2867	snow	21
2868	naan	21
2869	beach	21
2870	facilities	21
2871	results	21
2872	gooey	21
2873	exact	21
2874	dumplings	21
2875	fear	21
2876	soul	21
2877	smoking	21
2878	ol	21
2879	rental	21
2880	shelves	21
2881	cell	21
2882	masala	21
2883	array	21
2884	everyones	21
2885	johns	21
2886	smoothies	21
2887	rent	21
2888	refund	21
2889	shortly	21
2890	voice	21
2891	drank	21
2892	replace	21
2893	fixed	21
2894	afterwards	21
2895	searching	21
2896	flour	21
2897	press	21
2898	stops	21
2899	thus	21
2900	bobby	21
2901	lee	21
2902	regularly	21
2903	tomorrow	21
2904	beautifully	21
2905	panda	21
2906	nobody	21
2907	everytime	21
2908	kona	21
2909	falls	20
2910	rosemary	20
2911	korean	20
2912	rule	20
2913	exotic	20
2914	vendors	20
2915	land	20
2916	stack	20
2917	nine	20
2918	itll	20
2919	nowhere	20
2920	appear	20
2921	peas	20
2922	undercooked	20
2923	tank	20
2924	annoyed	20
2925	cat	20
2926	compliment	20
2927	buzz	20
2928	charging	20
2929	55	20
2930	meatball	20
2931	pickup	20
2932	spin	20
2933	repeat	20
2934	cuban	20
2935	coleslaw	20
2936	clientele	20
2937	satisfy	20
2938	terribly	20
2939	devil	20
2940	blueberry	20
2941	adds	20
2942	thrift	20
2943	character	20
2944	supplies	20
2945	shea	20
2946	amenities	20
2947	harkins	20
2948	venture	20
2949	flying	20
2950	blast	20
2951	bones	20
2952	jar	20
2953	nervous	20
2954	checkout	20
2955	hangout	20
2956	compliments	20
2957	pastrami	20
2958	5pm	20
2959	mothers	20
2960	obvious	20
2961	culture	20
2962	gigantic	20
2963	doctors	20
2964	hubs	20
2965	smart	20
2966	finishing	20
2967	informative	20
2968	arriving	20
2969	reviewing	20
2970	noon	20
2971	pig	20
2972	froyo	20
2973	peanuts	20
2974	skinny	20
2975	research	20
2976	marys	20
2977	join	20
2978	shirts	20
2979	tight	20
2980	brands	20
2981	chick	20
2982	featured	20
2983	trio	20
2984	states	20
2985	gifts	20
2986	upper	20
2987	purse	20
2988	kong	20
2989	carrot	20
2990	helps	20
2991	earth	20
2992	shut	20
2993	managers	20
2994	barber	20
2995	wanna	20
2996	bananas	20
2997	8pm	19
2998	creek	19
2999	80	19
3000	hostesses	19
3001	village	19
3002	attached	19
3003	combined	19
3004	tom	19
3005	mark	19
3006	membership	19
3007	dropping	19
3008	thousand	19
3009	fruity	19
3010	herei	19
3011	sauteed	19
3012	wendys	19
3013	comments	19
3014	ugh	19
3015	cottage	19
3016	opens	19
3017	fatty	19
3018	leaf	19
3019	greet	19
3020	u	19
3021	edge	19
3022	colored	19
3023	condition	19
3024	groceries	19
3025	suit	19
3026	twist	19
3027	failed	19
3028	apology	19
3029	draw	19
3030	21	19
3031	arrival	19
3032	baba	19
3033	female	19
3034	guessing	19
3035	mimosas	19
3036	tub	19
3037	cramped	19
3038	cab	19
3039	scary	19
3040	kudos	19
3041	enormous	19
3042	aka	19
3043	guide	19
3044	selected	19
3045	tenders	19
3046	iphone	19
3047	content	19
3048	insisted	19
3049	steps	19
3050	walnut	19
3051	sleep	19
3052	benches	19
3053	oatmeal	19
3054	nordstrom	19
3055	adventurous	19
3056	paired	19
3057	ages	19
3058	plays	19
3059	restrooms	19
3060	restroom	19
3061	deserves	19
3062	encountered	19
3063	lives	19
3064	paint	19
3065	tangy	19
3066	holiday	19
3067	ends	19
3068	historic	19
3069	hesitate	19
3070	minor	19
3071	tries	19
3072	relleno	19
3073	lasagna	19
3074	splurge	19
3075	6pm	19
3076	houses	19
3077	invited	19
3078	steakhouse	19
3079	ugly	19
3080	pies	19
3081	largest	19
3082	delux	19
3083	ethiopian	19
3084	approach	19
3085	couldve	19
3086	fuck	19
3087	hong	19
3088	concert	19
3089	lgo	19
3090	thorough	19
3091	metal	19
3092	watered	19
3093	refried	19
3094	drag	19
3095	silverware	19
3096	hed	19
3097	lodge	19
3098	legs	19
3099	players	19
3100	changs	19
3101	news	19
3102	c	19
3103	shaved	19
3104	tongue	19
3105	foie	19
3106	skills	18
3107	respect	18
3108	ensure	18
3109	charges	18
3110	lacks	18
3111	strawberries	18
3112	fortunately	18
3113	steal	18
3114	ordinary	18
3115	settled	18
3116	tenderloin	18
3117	yo	18
3118	chilly	18
3119	republic	18
3120	consisted	18
3121	couch	18
3122	companions	18
3123	hitting	18
3124	antipasto	18
3125	accessories	18
3126	steep	18
3127	nicer	18
3128	grande	18
3129	trout	18
3130	hi	18
3131	earned	18
3132	buck	18
3133	proper	18
3134	refused	18
3135	smothered	18
3136	competition	18
3137	tucson	18
3138	wished	18
3139	dinners	18
3140	1000	18
3141	ho	18
3142	swing	18
3143	vinaigrette	18
3144	sorbet	18
3145	amc	18
3146	evenings	18
3147	entertaining	18
3148	concoction	18
3149	faces	18
3150	trek	18
3151	cafeteria	18
3152	improve	18
3153	roof	18
3154	dying	18
3155	sunny	18
3156	runny	18
3157	fyi	18
3158	bird	18
3159	exciting	18
3160	settle	18
3161	latter	18
3162	indulge	18
3163	throwing	18
3164	chilled	18
3165	allowing	18
3166	sweetness	18
3167	target	18
3168	herbs	18
3169	decorations	18
3170	flag	18
3171	servings	18
3172	pride	18
3173	gin	18
3174	ken	18
3175	designer	18
3176	rates	18
3177	sesame	18
3178	dental	18
3179	hated	18
3180	noted	18
3181	blew	18
3182	neighbors	18
3183	bummer	18
3184	surrounding	18
3185	beware	18
3186	juices	18
3187	oreganos	18
3188	signed	18
3189	thrown	18
3190	addicted	18
3191	squash	18
3192	swim	18
3193	2010	18
3194	minimum	18
3195	naturally	18
3196	berry	18
3197	diamond	18
3198	built	18
3199	risotto	18
3200	diego	18
3201	edges	18
3202	hesitant	18
3203	ha	18
3204	conveniently	18
3205	remind	18
3206	northern	18
3207	songs	18
3208	kobe	18
3209	traveling	18
3210	outdated	18
3211	condiments	18
3212	stuffing	18
3213	17	18
3214	aisle	18
3215	establishments	18
3216	gripe	18
3217	misters	18
3218	setup	18
3219	muffins	18
3220	herself	18
3221	zero	18
3222	healthier	18
3223	mcdonalds	18
3224	yuck	18
3225	floors	18
3226	1st	18
3227	faster	18
3228	track	18
3229	oily	17
3230	blt	17
3231	sells	17
3232	degrees	17
3233	claimed	17
3234	gear	17
3235	client	17
3236	bothered	17
3237	scallop	17
3238	impeccable	17
3239	creations	17
3240	hire	17
3241	k	17
3242	route	17
3243	mountains	17
3244	study	17
3245	cibo	17
3246	atm	17
3247	assumed	17
3248	rack	17
3249	tradition	17
3250	screw	17
3251	smashburger	17
3252	appeal	17
3253	ricotta	17
3254	sundays	17
3255	filipino	17
3256	record	17
3257	sakana	17
3258	camera	17
3259	justify	17
3260	computer	17
3261	scheduled	17
3262	boiled	17
3263	encourage	17
3264	royal	17
3265	fruits	17
3266	da	17
3267	penny	17
3268	supposedly	17
3269	supply	17
3270	meaning	17
3271	push	17
3272	mad	17
3273	preparation	17
3274	delectable	17
3275	sight	17
3276	description	17
3277	wowed	17
3278	independent	17
3279	definite	17
3280	opt	17
3281	del	17
3282	cats	17
3283	removed	17
3284	essentially	17
3285	ignore	17
3286	socks	17
3287	sing	17
3288	um	17
3289	cutting	17
3290	flan	17
3291	cracker	17
3292	mushy	17
3293	cave	17
3294	screaming	17
3295	letting	17
3296	exterior	17
3297	daves	17
3298	clue	17
3299	courteous	17
3300	messed	17
3301	dipped	17
3302	rose	17
3303	ratio	17
3304	factory	17
3305	layer	17
3306	acceptable	17
3307	entertained	17
3308	fed	17
3309	disappeared	17
3310	jade	17
3311	modest	17
3312	proceeded	17
3313	pancake	17
3314	tan	17
3315	poorly	17
3316	alley	17
3317	replied	17
3318	rules	17
3319	obnoxious	17
3320	fireplace	17
3321	lately	17
3322	americanized	17
3323	steam	17
3324	appearance	17
3325	science	17
3326	genius	17
3327	providing	17
3328	warranty	17
3329	laugh	17
3330	shoulder	17
3331	vip	17
3332	bang	17
3333	necessary	17
3334	hung	17
3335	artist	17
3336	inches	17
3337	hills	17
3338	river	17
3339	knock	17
3340	mornings	17
3341	gnocchi	17
3342	sourdough	17
3343	lovers	17
3344	challenging	17
3345	companies	17
3346	ycs	17
3347	currently	17
3348	resist	17
3349	driven	17
3350	imo	17
3351	amazed	17
3352	message	17
3353	okra	17
3354	correctly	17
3355	watery	17
3356	dated	17
3357	kung	17
3358	pit	17
3359	101	17
3360	mock	17
